Reports/Гражданство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>Гражданство</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Лига</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лига</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Топ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ПеремещенияИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПеремещенияИгроков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Амплуа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Амплуа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Матч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Матч</Name>
			<BasedOn>
				<xr:Item>Catalog.Стадионы</xr:Item>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТурнирнаяТаблица</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стадионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗрителей</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗрителей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пенальти</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Игрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Чемпионаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Чемпионаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лига</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/Гражданство/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Лига") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Лига);
		
		Отчет.Лига = Параметры.Лига;

	ИначеЕсли Параметры.Свойство("Команда") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		
		Отчет.Команда = Параметры.Команда;
		
	Иначе
		Элементы.Лига.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступностьУстановить();
	Если ВладелецФормы = Неопределено Тогда
		АвтоЗаголовок		= Истина;
		ОтображатьЗаголовок	= Истина;
	КонецЕсли;
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Если ПроверитьЗаполнение() Тогда
		СкомпоноватьРезультат();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИгрокиПолучить(Страна)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Чемпионаты.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ Чемпионаты
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |		ПО ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка
	                      |ГДЕ
	                      |	Чемпионаты.Владелец = &Лига
	                      |	И Чемпионаты.ПометкаУдаления = ЛОЖЬ
	                      |	И Чемпионаты.ДатаОкончания В
	                      |			(ВЫБРАТЬ
	                      |				МАКСИМУМ(Чемпионаты.ДатаОкончания)
	                      |			ИЗ
	                      |				Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |					ПО
	                      |						ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка
	                      |			ГДЕ
	                      |				Чемпионаты.Владелец = &Лига
	                      |				И Чемпионаты.ПометкаУдаления = ЛОЖЬ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Перемещения.Игрок КАК Значение,
	                      |	Перемещения.Игрок.Наименование КАК Представление
	                      |ИЗ
	                      |	РегистрСведений.ПеремещенияИгроков.СрезПоследних КАК Перемещения
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	                      |		ПО Перемещения.Игрок = МатчСоставыКоманд.Игрок
	                      |			И Перемещения.Команда = МатчСоставыКоманд.Команда
	                      |ГДЕ
	                      |	Перемещения.Игрок.Страна = &Страна
	                      |	И Перемещения.Команда В
	                      |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |				ЧемпионатыКоманды.Команда
	                      |			ИЗ
	                      |				Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Чемпионаты КАК Чемпионаты
	                      |					ПО
	                      |						ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Перемещения.Игрок,
	                      |	Перемещения.Игрок.Наименование
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчСоставыКоманд.Ссылка), 0) УБЫВ,
	                      |	Представление");
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Перемещения.Игрок КАК Значение,
		               |	Перемещения.Игрок.Наименование КАК Представление
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних КАК Перемещения
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |		ПО Перемещения.Игрок = МатчСоставыКоманд.Игрок
		               |			И Перемещения.Команда = МатчСоставыКоманд.Команда
		               |ГДЕ
		               |	Перемещения.Команда = &Команда
		               |	И Перемещения.Игрок.Страна = &Страна
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Перемещения.Игрок,
		               |	Перемещения.Игрок.Наименование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчСоставыКоманд.Ссылка) УБЫВ,
		               |	Представление";
		Запрос.УстановитьПараметр("Команда",	Отчет.Команда);
	КонецЕсли;
	Запрос.УстановитьПараметр("Лига",	Отчет.Лига);
	Запрос.УстановитьПараметр("Страна",	Страна);
	Возврат СерверныйФункции.Выборка2СписокЗначений(Запрос.Выполнить().Выбрать());
КонецФункции

&НаСервере
Функция РезультатРасшифровки(Расшифровка)
	Значение = СерверныйФункции.ДанныеРасшифровкиПолучитьЗначение(ДанныеРасшифровки, Расшифровка);
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.Страны") Тогда
		Возврат ИгрокиПолучить(Значение);
	КонецЕсли;
	Возврат Значение;
КонецФункции

&НаКлиенте
Процедура Показать(Значение, СтандартнаяОбработка=Ложь)
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
	Иначе
		НаКлиенте.Показать(Значение, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбора(Элемент, ПараметрКоманды=Неопределено) Экспорт
	Показать(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	Значение	= РезультатРасшифровки(Расшифровка);
	Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		Значение.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), "Выберите игрока");
	Иначе
		Показать(Значение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДоступностьУстановить()
	Элементы.ФормаЗагрузитьВариант.Доступность	= (НЕ ЗначениеЗаполнено(Отчет.Команда));
	Элементы.Топ.Доступность					= (НЕ ЗначениеЗаполнено(Отчет.Команда) И НЕ Отчет.Лига.ОлимпийскаяСистема);
КонецПроцедуры

&НаКлиенте
Процедура ЛигаПриИзменении(Элемент)
	ЭлементПриИзменении(Элемент);
	ДоступностьУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ЭлементПриИзменении(Элемент)
	ОбщегоНазначения.СостояниеОтобразить(Элементы.Результат.ОтображениеСостояния);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Элементы.Лига.АвтоОтметкаНезаполненного
	И НЕ ЗначениеЗаполнено(Отчет.Лига)
	Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Укажите лигу", Отказ,, "Отчет.Лига");
	КонецЕсли;
КонецПроцедуры
